=================================================================================================================================================
Layer (type:depth-idx)                        Input Shape               Output Shape              Param #                   Kernel Shape
=================================================================================================================================================
ResNet50                                      [64, 3, 224, 224]         [64, 1000]                --                        --
├─ResNet: 1-1                                 [64, 3, 224, 224]         [64, 1000]                --                        --
│    └─Conv2d: 2-1                            [64, 3, 224, 224]         [64, 64, 112, 112]        9,408                     [7, 7]
│    └─BatchNorm2d: 2-2                       [64, 64, 112, 112]        [64, 64, 112, 112]        128                       --
│    └─ReLU: 2-3                              [64, 64, 112, 112]        [64, 64, 112, 112]        --                        --
│    └─MaxPool2d: 2-4                         [64, 64, 112, 112]        [64, 64, 56, 56]          --                        3
│    └─Sequential: 2-5                        [64, 64, 56, 56]          [64, 256, 56, 56]         --                        --
│    │    └─Bottleneck: 3-1                   [64, 64, 56, 56]          [64, 256, 56, 56]         --                        --
│    │    │    └─Conv2d: 4-1                  [64, 64, 56, 56]          [64, 64, 56, 56]          4,096                     [1, 1]
│    │    │    └─BatchNorm2d: 4-2             [64, 64, 56, 56]          [64, 64, 56, 56]          128                       --
│    │    │    └─ReLU: 4-3                    [64, 64, 56, 56]          [64, 64, 56, 56]          --                        --
│    │    │    └─Conv2d: 4-4                  [64, 64, 56, 56]          [64, 64, 56, 56]          36,864                    [3, 3]
│    │    │    └─BatchNorm2d: 4-5             [64, 64, 56, 56]          [64, 64, 56, 56]          128                       --
│    │    │    └─ReLU: 4-6                    [64, 64, 56, 56]          [64, 64, 56, 56]          --                        --
│    │    │    └─Conv2d: 4-7                  [64, 64, 56, 56]          [64, 256, 56, 56]         16,384                    [1, 1]
│    │    │    └─BatchNorm2d: 4-8             [64, 256, 56, 56]         [64, 256, 56, 56]         512                       --
│    │    │    └─Sequential: 4-9              [64, 64, 56, 56]          [64, 256, 56, 56]         --                        --
│    │    │    │    └─Conv2d: 5-1             [64, 64, 56, 56]          [64, 256, 56, 56]         16,384                    [1, 1]
│    │    │    │    └─BatchNorm2d: 5-2        [64, 256, 56, 56]         [64, 256, 56, 56]         512                       --
│    │    │    └─ReLU: 4-10                   [64, 256, 56, 56]         [64, 256, 56, 56]         --                        --
│    │    └─Bottleneck: 3-2                   [64, 256, 56, 56]         [64, 256, 56, 56]         --                        --
│    │    │    └─Conv2d: 4-11                 [64, 256, 56, 56]         [64, 64, 56, 56]          16,384                    [1, 1]
│    │    │    └─BatchNorm2d: 4-12            [64, 64, 56, 56]          [64, 64, 56, 56]          128                       --
│    │    │    └─ReLU: 4-13                   [64, 64, 56, 56]          [64, 64, 56, 56]          --                        --
│    │    │    └─Conv2d: 4-14                 [64, 64, 56, 56]          [64, 64, 56, 56]          36,864                    [3, 3]
│    │    │    └─BatchNorm2d: 4-15            [64, 64, 56, 56]          [64, 64, 56, 56]          128                       --
│    │    │    └─ReLU: 4-16                   [64, 64, 56, 56]          [64, 64, 56, 56]          --                        --
│    │    │    └─Conv2d: 4-17                 [64, 64, 56, 56]          [64, 256, 56, 56]         16,384                    [1, 1]
│    │    │    └─BatchNorm2d: 4-18            [64, 256, 56, 56]         [64, 256, 56, 56]         512                       --
│    │    │    └─ReLU: 4-19                   [64, 256, 56, 56]         [64, 256, 56, 56]         --                        --
│    │    └─Bottleneck: 3-3                   [64, 256, 56, 56]         [64, 256, 56, 56]         --                        --
│    │    │    └─Conv2d: 4-20                 [64, 256, 56, 56]         [64, 64, 56, 56]          16,384                    [1, 1]
│    │    │    └─BatchNorm2d: 4-21            [64, 64, 56, 56]          [64, 64, 56, 56]          128                       --
│    │    │    └─ReLU: 4-22                   [64, 64, 56, 56]          [64, 64, 56, 56]          --                        --
│    │    │    └─Conv2d: 4-23                 [64, 64, 56, 56]          [64, 64, 56, 56]          36,864                    [3, 3]
│    │    │    └─BatchNorm2d: 4-24            [64, 64, 56, 56]          [64, 64, 56, 56]          128                       --
│    │    │    └─ReLU: 4-25                   [64, 64, 56, 56]          [64, 64, 56, 56]          --                        --
│    │    │    └─Conv2d: 4-26                 [64, 64, 56, 56]          [64, 256, 56, 56]         16,384                    [1, 1]
│    │    │    └─BatchNorm2d: 4-27            [64, 256, 56, 56]         [64, 256, 56, 56]         512                       --
│    │    │    └─ReLU: 4-28                   [64, 256, 56, 56]         [64, 256, 56, 56]         --                        --
│    └─Sequential: 2-6                        [64, 256, 56, 56]         [64, 512, 28, 28]         --                        --
│    │    └─Bottleneck: 3-4                   [64, 256, 56, 56]         [64, 512, 28, 28]         --                        --
│    │    │    └─Conv2d: 4-29                 [64, 256, 56, 56]         [64, 128, 56, 56]         32,768                    [1, 1]
│    │    │    └─BatchNorm2d: 4-30            [64, 128, 56, 56]         [64, 128, 56, 56]         256                       --
│    │    │    └─ReLU: 4-31                   [64, 128, 56, 56]         [64, 128, 56, 56]         --                        --
│    │    │    └─Conv2d: 4-32                 [64, 128, 56, 56]         [64, 128, 28, 28]         147,456                   [3, 3]
│    │    │    └─BatchNorm2d: 4-33            [64, 128, 28, 28]         [64, 128, 28, 28]         256                       --
│    │    │    └─ReLU: 4-34                   [64, 128, 28, 28]         [64, 128, 28, 28]         --                        --
│    │    │    └─Conv2d: 4-35                 [64, 128, 28, 28]         [64, 512, 28, 28]         65,536                    [1, 1]
│    │    │    └─BatchNorm2d: 4-36            [64, 512, 28, 28]         [64, 512, 28, 28]         1,024                     --
│    │    │    └─Sequential: 4-37             [64, 256, 56, 56]         [64, 512, 28, 28]         --                        --
│    │    │    │    └─Conv2d: 5-3             [64, 256, 56, 56]         [64, 512, 28, 28]         131,072                   [1, 1]
│    │    │    │    └─BatchNorm2d: 5-4        [64, 512, 28, 28]         [64, 512, 28, 28]         1,024                     --
│    │    │    └─ReLU: 4-38                   [64, 512, 28, 28]         [64, 512, 28, 28]         --                        --
│    │    └─Bottleneck: 3-5                   [64, 512, 28, 28]         [64, 512, 28, 28]         --                        --
│    │    │    └─Conv2d: 4-39                 [64, 512, 28, 28]         [64, 128, 28, 28]         65,536                    [1, 1]
│    │    │    └─BatchNorm2d: 4-40            [64, 128, 28, 28]         [64, 128, 28, 28]         256                       --
│    │    │    └─ReLU: 4-41                   [64, 128, 28, 28]         [64, 128, 28, 28]         --                        --
│    │    │    └─Conv2d: 4-42                 [64, 128, 28, 28]         [64, 128, 28, 28]         147,456                   [3, 3]
│    │    │    └─BatchNorm2d: 4-43            [64, 128, 28, 28]         [64, 128, 28, 28]         256                       --
│    │    │    └─ReLU: 4-44                   [64, 128, 28, 28]         [64, 128, 28, 28]         --                        --
│    │    │    └─Conv2d: 4-45                 [64, 128, 28, 28]         [64, 512, 28, 28]         65,536                    [1, 1]
│    │    │    └─BatchNorm2d: 4-46            [64, 512, 28, 28]         [64, 512, 28, 28]         1,024                     --
│    │    │    └─ReLU: 4-47                   [64, 512, 28, 28]         [64, 512, 28, 28]         --                        --
│    │    └─Bottleneck: 3-6                   [64, 512, 28, 28]         [64, 512, 28, 28]         --                        --
│    │    │    └─Conv2d: 4-48                 [64, 512, 28, 28]         [64, 128, 28, 28]         65,536                    [1, 1]
│    │    │    └─BatchNorm2d: 4-49            [64, 128, 28, 28]         [64, 128, 28, 28]         256                       --
│    │    │    └─ReLU: 4-50                   [64, 128, 28, 28]         [64, 128, 28, 28]         --                        --
│    │    │    └─Conv2d: 4-51                 [64, 128, 28, 28]         [64, 128, 28, 28]         147,456                   [3, 3]
│    │    │    └─BatchNorm2d: 4-52            [64, 128, 28, 28]         [64, 128, 28, 28]         256                       --
│    │    │    └─ReLU: 4-53                   [64, 128, 28, 28]         [64, 128, 28, 28]         --                        --
│    │    │    └─Conv2d: 4-54                 [64, 128, 28, 28]         [64, 512, 28, 28]         65,536                    [1, 1]
│    │    │    └─BatchNorm2d: 4-55            [64, 512, 28, 28]         [64, 512, 28, 28]         1,024                     --
│    │    │    └─ReLU: 4-56                   [64, 512, 28, 28]         [64, 512, 28, 28]         --                        --
│    │    └─Bottleneck: 3-7                   [64, 512, 28, 28]         [64, 512, 28, 28]         --                        --
│    │    │    └─Conv2d: 4-57                 [64, 512, 28, 28]         [64, 128, 28, 28]         65,536                    [1, 1]
│    │    │    └─BatchNorm2d: 4-58            [64, 128, 28, 28]         [64, 128, 28, 28]         256                       --
│    │    │    └─ReLU: 4-59                   [64, 128, 28, 28]         [64, 128, 28, 28]         --                        --
│    │    │    └─Conv2d: 4-60                 [64, 128, 28, 28]         [64, 128, 28, 28]         147,456                   [3, 3]
│    │    │    └─BatchNorm2d: 4-61            [64, 128, 28, 28]         [64, 128, 28, 28]         256                       --
│    │    │    └─ReLU: 4-62                   [64, 128, 28, 28]         [64, 128, 28, 28]         --                        --
│    │    │    └─Conv2d: 4-63                 [64, 128, 28, 28]         [64, 512, 28, 28]         65,536                    [1, 1]
│    │    │    └─BatchNorm2d: 4-64            [64, 512, 28, 28]         [64, 512, 28, 28]         1,024                     --
│    │    │    └─ReLU: 4-65                   [64, 512, 28, 28]         [64, 512, 28, 28]         --                        --
│    └─Sequential: 2-7                        [64, 512, 28, 28]         [64, 1024, 14, 14]        --                        --
│    │    └─Bottleneck: 3-8                   [64, 512, 28, 28]         [64, 1024, 14, 14]        --                        --
│    │    │    └─Conv2d: 4-66                 [64, 512, 28, 28]         [64, 256, 28, 28]         131,072                   [1, 1]
│    │    │    └─BatchNorm2d: 4-67            [64, 256, 28, 28]         [64, 256, 28, 28]         512                       --
│    │    │    └─ReLU: 4-68                   [64, 256, 28, 28]         [64, 256, 28, 28]         --                        --
│    │    │    └─Conv2d: 4-69                 [64, 256, 28, 28]         [64, 256, 14, 14]         589,824                   [3, 3]
│    │    │    └─BatchNorm2d: 4-70            [64, 256, 14, 14]         [64, 256, 14, 14]         512                       --
│    │    │    └─ReLU: 4-71                   [64, 256, 14, 14]         [64, 256, 14, 14]         --                        --
│    │    │    └─Conv2d: 4-72                 [64, 256, 14, 14]         [64, 1024, 14, 14]        262,144                   [1, 1]
│    │    │    └─BatchNorm2d: 4-73            [64, 1024, 14, 14]        [64, 1024, 14, 14]        2,048                     --
│    │    │    └─Sequential: 4-74             [64, 512, 28, 28]         [64, 1024, 14, 14]        --                        --
│    │    │    │    └─Conv2d: 5-5             [64, 512, 28, 28]         [64, 1024, 14, 14]        524,288                   [1, 1]
│    │    │    │    └─BatchNorm2d: 5-6        [64, 1024, 14, 14]        [64, 1024, 14, 14]        2,048                     --
│    │    │    └─ReLU: 4-75                   [64, 1024, 14, 14]        [64, 1024, 14, 14]        --                        --
│    │    └─Bottleneck: 3-9                   [64, 1024, 14, 14]        [64, 1024, 14, 14]        --                        --
│    │    │    └─Conv2d: 4-76                 [64, 1024, 14, 14]        [64, 256, 14, 14]         262,144                   [1, 1]
│    │    │    └─BatchNorm2d: 4-77            [64, 256, 14, 14]         [64, 256, 14, 14]         512                       --
│    │    │    └─ReLU: 4-78                   [64, 256, 14, 14]         [64, 256, 14, 14]         --                        --
│    │    │    └─Conv2d: 4-79                 [64, 256, 14, 14]         [64, 256, 14, 14]         589,824                   [3, 3]
│    │    │    └─BatchNorm2d: 4-80            [64, 256, 14, 14]         [64, 256, 14, 14]         512                       --
│    │    │    └─ReLU: 4-81                   [64, 256, 14, 14]         [64, 256, 14, 14]         --                        --
│    │    │    └─Conv2d: 4-82                 [64, 256, 14, 14]         [64, 1024, 14, 14]        262,144                   [1, 1]
│    │    │    └─BatchNorm2d: 4-83            [64, 1024, 14, 14]        [64, 1024, 14, 14]        2,048                     --
│    │    │    └─ReLU: 4-84                   [64, 1024, 14, 14]        [64, 1024, 14, 14]        --                        --
│    │    └─Bottleneck: 3-10                  [64, 1024, 14, 14]        [64, 1024, 14, 14]        --                        --
│    │    │    └─Conv2d: 4-85                 [64, 1024, 14, 14]        [64, 256, 14, 14]         262,144                   [1, 1]
│    │    │    └─BatchNorm2d: 4-86            [64, 256, 14, 14]         [64, 256, 14, 14]         512                       --
│    │    │    └─ReLU: 4-87                   [64, 256, 14, 14]         [64, 256, 14, 14]         --                        --
│    │    │    └─Conv2d: 4-88                 [64, 256, 14, 14]         [64, 256, 14, 14]         589,824                   [3, 3]
│    │    │    └─BatchNorm2d: 4-89            [64, 256, 14, 14]         [64, 256, 14, 14]         512                       --
│    │    │    └─ReLU: 4-90                   [64, 256, 14, 14]         [64, 256, 14, 14]         --                        --
│    │    │    └─Conv2d: 4-91                 [64, 256, 14, 14]         [64, 1024, 14, 14]        262,144                   [1, 1]
│    │    │    └─BatchNorm2d: 4-92            [64, 1024, 14, 14]        [64, 1024, 14, 14]        2,048                     --
│    │    │    └─ReLU: 4-93                   [64, 1024, 14, 14]        [64, 1024, 14, 14]        --                        --
│    │    └─Bottleneck: 3-11                  [64, 1024, 14, 14]        [64, 1024, 14, 14]        --                        --
│    │    │    └─Conv2d: 4-94                 [64, 1024, 14, 14]        [64, 256, 14, 14]         262,144                   [1, 1]
│    │    │    └─BatchNorm2d: 4-95            [64, 256, 14, 14]         [64, 256, 14, 14]         512                       --
│    │    │    └─ReLU: 4-96                   [64, 256, 14, 14]         [64, 256, 14, 14]         --                        --
│    │    │    └─Conv2d: 4-97                 [64, 256, 14, 14]         [64, 256, 14, 14]         589,824                   [3, 3]
│    │    │    └─BatchNorm2d: 4-98            [64, 256, 14, 14]         [64, 256, 14, 14]         512                       --
│    │    │    └─ReLU: 4-99                   [64, 256, 14, 14]         [64, 256, 14, 14]         --                        --
│    │    │    └─Conv2d: 4-100                [64, 256, 14, 14]         [64, 1024, 14, 14]        262,144                   [1, 1]
│    │    │    └─BatchNorm2d: 4-101           [64, 1024, 14, 14]        [64, 1024, 14, 14]        2,048                     --
│    │    │    └─ReLU: 4-102                  [64, 1024, 14, 14]        [64, 1024, 14, 14]        --                        --
│    │    └─Bottleneck: 3-12                  [64, 1024, 14, 14]        [64, 1024, 14, 14]        --                        --
│    │    │    └─Conv2d: 4-103                [64, 1024, 14, 14]        [64, 256, 14, 14]         262,144                   [1, 1]
│    │    │    └─BatchNorm2d: 4-104           [64, 256, 14, 14]         [64, 256, 14, 14]         512                       --
│    │    │    └─ReLU: 4-105                  [64, 256, 14, 14]         [64, 256, 14, 14]         --                        --
│    │    │    └─Conv2d: 4-106                [64, 256, 14, 14]         [64, 256, 14, 14]         589,824                   [3, 3]
│    │    │    └─BatchNorm2d: 4-107           [64, 256, 14, 14]         [64, 256, 14, 14]         512                       --
│    │    │    └─ReLU: 4-108                  [64, 256, 14, 14]         [64, 256, 14, 14]         --                        --
│    │    │    └─Conv2d: 4-109                [64, 256, 14, 14]         [64, 1024, 14, 14]        262,144                   [1, 1]
│    │    │    └─BatchNorm2d: 4-110           [64, 1024, 14, 14]        [64, 1024, 14, 14]        2,048                     --
│    │    │    └─ReLU: 4-111                  [64, 1024, 14, 14]        [64, 1024, 14, 14]        --                        --
│    │    └─Bottleneck: 3-13                  [64, 1024, 14, 14]        [64, 1024, 14, 14]        --                        --
│    │    │    └─Conv2d: 4-112                [64, 1024, 14, 14]        [64, 256, 14, 14]         262,144                   [1, 1]
│    │    │    └─BatchNorm2d: 4-113           [64, 256, 14, 14]         [64, 256, 14, 14]         512                       --
│    │    │    └─ReLU: 4-114                  [64, 256, 14, 14]         [64, 256, 14, 14]         --                        --
│    │    │    └─Conv2d: 4-115                [64, 256, 14, 14]         [64, 256, 14, 14]         589,824                   [3, 3]
│    │    │    └─BatchNorm2d: 4-116           [64, 256, 14, 14]         [64, 256, 14, 14]         512                       --
│    │    │    └─ReLU: 4-117                  [64, 256, 14, 14]         [64, 256, 14, 14]         --                        --
│    │    │    └─Conv2d: 4-118                [64, 256, 14, 14]         [64, 1024, 14, 14]        262,144                   [1, 1]
│    │    │    └─BatchNorm2d: 4-119           [64, 1024, 14, 14]        [64, 1024, 14, 14]        2,048                     --
│    │    │    └─ReLU: 4-120                  [64, 1024, 14, 14]        [64, 1024, 14, 14]        --                        --
│    └─Sequential: 2-8                        [64, 1024, 14, 14]        [64, 2048, 7, 7]          --                        --
│    │    └─Bottleneck: 3-14                  [64, 1024, 14, 14]        [64, 2048, 7, 7]          --                        --
│    │    │    └─Conv2d: 4-121                [64, 1024, 14, 14]        [64, 512, 14, 14]         524,288                   [1, 1]
│    │    │    └─BatchNorm2d: 4-122           [64, 512, 14, 14]         [64, 512, 14, 14]         1,024                     --
│    │    │    └─ReLU: 4-123                  [64, 512, 14, 14]         [64, 512, 14, 14]         --                        --
│    │    │    └─Conv2d: 4-124                [64, 512, 14, 14]         [64, 512, 7, 7]           2,359,296                 [3, 3]
│    │    │    └─BatchNorm2d: 4-125           [64, 512, 7, 7]           [64, 512, 7, 7]           1,024                     --
│    │    │    └─ReLU: 4-126                  [64, 512, 7, 7]           [64, 512, 7, 7]           --                        --
│    │    │    └─Conv2d: 4-127                [64, 512, 7, 7]           [64, 2048, 7, 7]          1,048,576                 [1, 1]
│    │    │    └─BatchNorm2d: 4-128           [64, 2048, 7, 7]          [64, 2048, 7, 7]          4,096                     --
│    │    │    └─Sequential: 4-129            [64, 1024, 14, 14]        [64, 2048, 7, 7]          --                        --
│    │    │    │    └─Conv2d: 5-7             [64, 1024, 14, 14]        [64, 2048, 7, 7]          2,097,152                 [1, 1]
│    │    │    │    └─BatchNorm2d: 5-8        [64, 2048, 7, 7]          [64, 2048, 7, 7]          4,096                     --
│    │    │    └─ReLU: 4-130                  [64, 2048, 7, 7]          [64, 2048, 7, 7]          --                        --
│    │    └─Bottleneck: 3-15                  [64, 2048, 7, 7]          [64, 2048, 7, 7]          --                        --
│    │    │    └─Conv2d: 4-131                [64, 2048, 7, 7]          [64, 512, 7, 7]           1,048,576                 [1, 1]
│    │    │    └─BatchNorm2d: 4-132           [64, 512, 7, 7]           [64, 512, 7, 7]           1,024                     --
│    │    │    └─ReLU: 4-133                  [64, 512, 7, 7]           [64, 512, 7, 7]           --                        --
│    │    │    └─Conv2d: 4-134                [64, 512, 7, 7]           [64, 512, 7, 7]           2,359,296                 [3, 3]
│    │    │    └─BatchNorm2d: 4-135           [64, 512, 7, 7]           [64, 512, 7, 7]           1,024                     --
│    │    │    └─ReLU: 4-136                  [64, 512, 7, 7]           [64, 512, 7, 7]           --                        --
│    │    │    └─Conv2d: 4-137                [64, 512, 7, 7]           [64, 2048, 7, 7]          1,048,576                 [1, 1]
│    │    │    └─BatchNorm2d: 4-138           [64, 2048, 7, 7]          [64, 2048, 7, 7]          4,096                     --
│    │    │    └─ReLU: 4-139                  [64, 2048, 7, 7]          [64, 2048, 7, 7]          --                        --
│    │    └─Bottleneck: 3-16                  [64, 2048, 7, 7]          [64, 2048, 7, 7]          --                        --
│    │    │    └─Conv2d: 4-140                [64, 2048, 7, 7]          [64, 512, 7, 7]           1,048,576                 [1, 1]
│    │    │    └─BatchNorm2d: 4-141           [64, 512, 7, 7]           [64, 512, 7, 7]           1,024                     --
│    │    │    └─ReLU: 4-142                  [64, 512, 7, 7]           [64, 512, 7, 7]           --                        --
│    │    │    └─Conv2d: 4-143                [64, 512, 7, 7]           [64, 512, 7, 7]           2,359,296                 [3, 3]
│    │    │    └─BatchNorm2d: 4-144           [64, 512, 7, 7]           [64, 512, 7, 7]           1,024                     --
│    │    │    └─ReLU: 4-145                  [64, 512, 7, 7]           [64, 512, 7, 7]           --                        --
│    │    │    └─Conv2d: 4-146                [64, 512, 7, 7]           [64, 2048, 7, 7]          1,048,576                 [1, 1]
│    │    │    └─BatchNorm2d: 4-147           [64, 2048, 7, 7]          [64, 2048, 7, 7]          4,096                     --
│    │    │    └─ReLU: 4-148                  [64, 2048, 7, 7]          [64, 2048, 7, 7]          --                        --
│    └─AdaptiveAvgPool2d: 2-9                 [64, 2048, 7, 7]          [64, 2048, 1, 1]          --                        --
│    └─Linear: 2-10                           [64, 2048]                [64, 1000]                2,049,000                 --
=================================================================================================================================================
Total params: 25,557,032
Trainable params: 25,557,032
Non-trainable params: 0
Total mult-adds (Units.GIGABYTES): 261.71
=================================================================================================================================================
Input size (MB): 38.54
Forward/backward pass size (MB): 11381.23
Params size (MB): 102.23
Estimated Total Size (MB): 11521.99
=================================================================================================================================================